# Наша Вселенная
universe = {"Шон", "Блэкки", "Снежок", "Пират", "Облачко", "Уголёк", "Зевс", "Титан"}

# Множества по признакам
white_wool = {"Шон", "Снежок", "Облачко", "Зевс"}
blue_eyes = {"Шон", "Пират", "Облачко", "Титан"}
has_horns = {"Шон", "Блэкки", "Зевс", "Титан"}

# 2. Практика:
# Кто самый крутой (белый, голубоглазый и с рогами)?
the_best = white_wool & blue_eyes & has_horns
print(f"Самый крутой: {the_best}")  # {'Шон'}

# Кто белый и голубоглазый, но БЕЗ рожек?
cute_ones = (white_wool & blue_eyes) - has_horns
print(f"Милашки: {cute_ones}")      # {'Облачко'}

# Список всех барашков, у которых есть ХОТЯ БЫ ОДИН признак из наших кругов
any_feature = white_wool | blue_eyes | has_horns
print(f"Всего в кругах: {len(any_feature)} барашков")

# Изгои стада
print(f"Изгои стада: {universe - any_feature}")  # {'Уголёк'}